/*
* Лабораторная работа No1
* Исследование комментариев С++:
*
* Developer:
*/
/*--------------------------------------------------------------------------*/
// include lib
/*--------------------------------------------------------------------------*/
#include <iostream> /* Подключаем библиотеку для ввода/вывода */
/*--------------------------------------------------------------------------*/
// Тут будут глобальные переменные
/*--------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------*/
// main - главная функция с которой начинается исполнение программы
/*--------------------------------------------------------------------------*/
int main()
{ /* Открытая скобка - начало блока стейтмена, кода относящийся к функции main */
// Тело функции
#if 0
Вывод в консоль
#endif
std::cout << "Гибкость ума обломает любую железную логику" << std::endl;
return 0; // Возвращаемое значение

} /* Закрытая скобка - окончание блока стейтмена, кода относящийся к функции main */
/*--------------------------------------------------------------------------*/
// end main_cpp
/*--------------------------------------------------------------------------*/
