/*
* Лабораторная работа No1
* Исследование ввода-вывода стандартной библиотеки С++
* Типы данных
* Developer:
*/
/*==========================================================================*/
/* INCLUDE LIBS */
/*==========================================================================*/
#include <QCoreApplication> /* Подключаем библиотеку QCoreApplication */
#include <iostream> /* Подключаем библиотеку для ввода/вывода */
#include <stdio.h> /* Подключаем библиотеку для printf */
//using namespace std; /* Пространство имен std */

/*==========================================================================*/
/* Инициализация переменных */
/*==========================================================================*/

double weightIndex,weight;
int age,height,choice;
bool gender;
char genderTxt;

/*==========================================================================*/
/* funcBrock - Функция вычисления индекса массы тела по формуле Брока */
/*==========================================================================*/

int funcBrock(int age,int weight,int height,bool gender) {
    if (gender) {
       weightIndex= (height - 100)*0.9;
    }
    else {
       weightIndex= (height - 100)*0.85;
    }
    return weightIndex;
}

/*==========================================================================*/
/* funcIMT - Функция вычисления индекса массы тела по формуле Брока */
/*==========================================================================*/

double funcIMT(int age,int weight,int height) {
    weightIndex = weight / ((height*0.01)*(height*0.01));
    return weightIndex;
}


/*==========================================================================*/
/* main - главная функция с которой начинается исполнение программы */
/*==========================================================================*/
int main(int argc, char *argv[])
{
std::cout << "****Калькулятор для рассчета идеального веса*****" << std::endl; // вывод сообщения


first:
std::cout << "Введите свой возраст (полных лет) и нажмите клавишу ввода (ENTER) ";
std::cin >> age;
std::cout << "Введите свой вес и нажмите клавишу ввода (ENTER) ";
std::cin >> weight;
std::cout << "Введите свой рост в см и нажмите клавишу ввода (ENTER) ";
std::cin >> height;
std::cout << "Укажите пол (1 - мужчина, 0 - женщина)  и нажмите клавишу ввода (ENTER) ";
std::cin >> gender;

if (gender) {
    genderTxt = 'М';
}
else {
    genderTxt = 'Ж';
}

second:
std::cout << "Ваш возраст: " << age << " Ваш вес: " << weight << "кг. Ваш рост: " << height << "см. Ваш пол: " << genderTxt << std::endl;
std::cout << "Если нет ошибки - выберите формулу подсчета веса. В противном случае введите 0, для повтора ввода."<< std::endl;
std::cout << "1 - Формула Брока. 2 - ИМТ"<< std::endl;
std::cin >> choice;

if (choice == 1) {
 weightIndex = funcBrock(age,weight,height,gender);
 std::cout << "Ваш идеальный вес по формуле Брока: " << weightIndex << std::endl;
 if (weightIndex>weight){
    std::cout << "Ваш текущий вес: "<<weight<< " кг. Ваш дифицит веса - " << weightIndex-weight << "кг."<< std::endl;
 }
 else {
     std::cout << "Ваш текущий вес: "<<weight<< " кг. Ваш избыточный вес - " << weight-weightIndex << "кг."<< std::endl;
 }

}
else if (choice == 2) {
  std::cout << "Ваш индекс тела по формуле ИМТ: " << funcIMT(age,weight,height) << std::endl;

}
else if (choice == 0) {
    goto first;
}
else {
    std::cout << "Вы ввели неверное значение, повторите выбор!" << std::endl;
    goto second;
}



if (age >= 19 && age <= 24 ) {



}



} /* Закрытая скобка - окончание блока стейтмена, кода относящийся к функции main */


